Hi @watsonjm , Thank you for submitting this. Wildcard for fqdn is supported since FOS6.2.2 (https://docs.fortinet.com/document/fortigate/6.2.0/new-features/329154/support-for-wildcard-fqdn-addresses-in-firewall-policy-6-2-2). Don't know which FOS version you are running. Can you please replace wildcard_fqdn with fqdn? As shown in the following example:
```

provider "fortios" {
  hostname = "192.168.52.177"
  token = "GNH7r40H65GNb46kd4rG8rtrmn0fr1" 
  insecure = "true"
}

locals {
  allowed_wildcard_urls = {
    "*.digicert.com"                = "Digicert Cert checks"
    "*.go.microsoft.com"            = "Windows Activation"
    "*.download.windowsupdate.com"  = "Windows Udpates"
    "*.windowsupdate.com"           = "Windows Udpates"
    "*.update.microsoft.com"        = "Windows Udpates"
    "*.windowsupdate.microsoft.com" = "Windows Udpates"
  }
}

##resources
resource "fortios_firewall_address" "allowed_wildcard_url" {
  for_each      = local.allowed_wildcard_urls
  name          = each.key
  allow_routing = "disable"
  cache_ttl     = 0
  color         = 19
  visibility    = "enable"
  type          = "fqdn"
  fqdn          = each.key                         <===============================================
  comment       = "Terraform: ${each.value}"
}
```

```
# terraform apply
2020/10/30 12:35:14 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_address.allowed_wildcard_url["*.digicert.com"] will be created
  + resource "fortios_firewall_address" "allowed_wildcard_url" {
      + allow_routing        = "disable"
      + associated_interface = (known after apply)
      + cache_ttl            = 0
      + color                = 19
      + comment              = "Terraform: Digicert Cert checks"
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = "*.digicert.com"
      + id                   = (known after apply)
      + name                 = "*.digicert.com"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = (known after apply)
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "fqdn"
      + uuid                 = (known after apply)
      + visibility           = "enable"
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.allowed_wildcard_url["*.download.windowsupdate.com"] will be created
  + resource "fortios_firewall_address" "allowed_wildcard_url" {
      + allow_routing        = "disable"
      + associated_interface = (known after apply)
      + cache_ttl            = 0
      + color                = 19
      + comment              = "Terraform: Windows Udpates"
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = "*.download.windowsupdate.com"
      + id                   = (known after apply)
      + name                 = "*.download.windowsupdate.com"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = (known after apply)
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "fqdn"
      + uuid                 = (known after apply)
      + visibility           = "enable"
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.allowed_wildcard_url["*.go.microsoft.com"] will be created
  + resource "fortios_firewall_address" "allowed_wildcard_url" {
      + allow_routing        = "disable"
      + associated_interface = (known after apply)
      + cache_ttl            = 0
      + color                = 19
      + comment              = "Terraform: Windows Activation"
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = "*.go.microsoft.com"
      + id                   = (known after apply)
      + name                 = "*.go.microsoft.com"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = (known after apply)
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "fqdn"
      + uuid                 = (known after apply)
      + visibility           = "enable"
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.allowed_wildcard_url["*.update.microsoft.com"] will be created
  + resource "fortios_firewall_address" "allowed_wildcard_url" {
      + allow_routing        = "disable"
      + associated_interface = (known after apply)
      + cache_ttl            = 0
      + color                = 19
      + comment              = "Terraform: Windows Udpates"
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = "*.update.microsoft.com"
      + id                   = (known after apply)
      + name                 = "*.update.microsoft.com"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = (known after apply)
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "fqdn"
      + uuid                 = (known after apply)
      + visibility           = "enable"
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.allowed_wildcard_url["*.windowsupdate.com"] will be created
  + resource "fortios_firewall_address" "allowed_wildcard_url" {
      + allow_routing        = "disable"
      + associated_interface = (known after apply)
      + cache_ttl            = 0
      + color                = 19
      + comment              = "Terraform: Windows Udpates"
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = "*.windowsupdate.com"
      + id                   = (known after apply)
      + name                 = "*.windowsupdate.com"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = (known after apply)
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "fqdn"
      + uuid                 = (known after apply)
      + visibility           = "enable"
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.allowed_wildcard_url["*.windowsupdate.microsoft.com"] will be created
  + resource "fortios_firewall_address" "allowed_wildcard_url" {
      + allow_routing        = "disable"
      + associated_interface = (known after apply)
      + cache_ttl            = 0
      + color                = 19
      + comment              = "Terraform: Windows Udpates"
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = "*.windowsupdate.microsoft.com"
      + id                   = (known after apply)
      + name                 = "*.windowsupdate.microsoft.com"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = (known after apply)
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "fqdn"
      + uuid                 = (known after apply)
      + visibility           = "enable"
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_address.allowed_wildcard_url["*.download.windowsupdate.com"]: Creating...
fortios_firewall_address.allowed_wildcard_url["*.windowsupdate.com"]: Creating...
fortios_firewall_address.allowed_wildcard_url["*.update.microsoft.com"]: Creating...
fortios_firewall_address.allowed_wildcard_url["*.go.microsoft.com"]: Creating...
fortios_firewall_address.allowed_wildcard_url["*.digicert.com"]: Creating...
fortios_firewall_address.allowed_wildcard_url["*.windowsupdate.microsoft.com"]: Creating...
fortios_firewall_address.allowed_wildcard_url["*.windowsupdate.com"]: Creation complete after 0s [id=*.windowsupdate.com]
fortios_firewall_address.allowed_wildcard_url["*.digicert.com"]: Creation complete after 0s [id=*.digicert.com]
fortios_firewall_address.allowed_wildcard_url["*.update.microsoft.com"]: Creation complete after 0s [id=*.update.microsoft.com]
fortios_firewall_address.allowed_wildcard_url["*.download.windowsupdate.com"]: Creation complete after 0s [id=*.download.windowsupdate.com]
fortios_firewall_address.allowed_wildcard_url["*.windowsupdate.microsoft.com"]: Creation complete after 0s [id=*.windowsupdate.microsoft.com]
fortios_firewall_address.allowed_wildcard_url["*.go.microsoft.com"]: Creation complete after 0s [id=*.go.microsoft.com]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

```
I have verified the above examples on 6.2.4, 6.4.0, and 6.4.2, and the results are all successful:
![fff](https://user-images.githubusercontent.com/49291382/97693502-3b99e200-1adc-11eb-9372-3f56746783c6.png)

Let me know if you have any questions. Hope it helps. Thanks!